Tekla Open API Reference for Tekla Structures 2025
ProfileItemCrossSection.CrossSectionNumber Property
Note: This API is now obsolete.
 Gets or sets a value of the property CrossSectionNumber.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Deprecated. Please use Number instead.")]
public int CrossSectionNumber { get; set; }
<ObsoleteAttribute("Deprecated. Please use Number instead.")>
Public Property CrossSectionNumber As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ProfileItemCrossSection Class
Tekla.Structures.Catalogs Namespace